from django.shortcuts import render


def show_prices(request):
    blocks = [
        {
            'header': 'Групповые занятия',
            'content': [
                ['Длительность', 'Кол-во занятий', 'Стоимость занятий', ''],
                ['', '', 'Взрослые (от 17 лет)', 'Дети (от 3 до 16 лет)'],
                ['90 мин', '8', '3000 руб', '2700 руб'],
                ['', '12', '3500 руб', '3200 руб']
            ]
         },
        {
            'header': 'Индивидуальные занятия',
            'content': [
                ['Длительность', 'Кол-во занятий', 'Стоимость занятий', ''],
                ['', '', 'Взрослые (от 17 лет)', 'Дети (от 3 до 16 лет)'],
                ['90 мин', '8', '5000 руб', '4900 руб'],
                ['', '12', '6000 руб', '5600 руб']
            ]
        }
    ]
    return render(
        request,
        'prices/prices.html',
        {'blocks': blocks}
    )
