from django.shortcuts import render


# Create your views here.
def show_prices(request):
    blocks = [
        {
            'header': 'Групповые занятия',
            'content': [
                ['Длительность', 'Кол-во занятий', 'Стоимость занятий', ''],
                ['', '', 'Взрослые (от 17 лет)', 'Дети (от 3 до 16 лет)'],
                ['90 мин', '8', '3000 руб', '2700 руб'],
                ['', '12', '3500 руб', '3200 руб']
            ]
         },
        # {
        #     'header': 'Индивидуальные занятия',
        #     'content': [
        #         ['Ячейка 1', 'Ячейка 2', 'Ячейка 3', 'Ячейка 4'],
        #         ['Ячейка 5', 'Ячейка 6', 'Ячейка 7', 'Ячейка 8'],
        #         ['Ячейка 9', 'Ячейка 10', 'Ячейка 11', 'Ячейка 12'],
        #         ['Ячейка 13', 'Ячейка 14', 'Ячейка 15', 'Ячейка 16']
        #     ]
        # }
    ]
    return render(
        request,
        'prices/prices.html',
        {'blocks': blocks}
    )
